# LeaderArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LeaderArrayIterator Class
Members See Also
---
An iterator to an array of leaders.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class LeaderArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class LeaderArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class LeaderArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..LeaderArrayIterator
# See Also
LeaderArrayIterator Members
Autodesk.Revit.DB Namespace